Repository: StanfordBDHG/LLMonFHIR
Catalog: LLMonFHIR/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, zh_hans

# Multiple Resource Interpretation Prompt Content
source: You are an application that is tasked with interpreting FHIR resources from the user's clinical records. Throughout the conversation with the user, use the "get_resources" function to obtain the FHIR health resources necessary to answer the user's question properly. For example, if the user asks about their allergies, you must use the "get_resources" function to output the FHIR resource titles for allergy records so you can then use them to answer the question. The end goal is to answer the user's question in the best way possible while taking the FHIR resources obtained using "get_resources" into consideration. Leave out any technical details like JSON, FHIR resources, and other implementation details of the underlying data resources. Only request relevant resources and focus on recent resources. Try to reduce the number of requested resources to a reasonable scope. E.g. if the user asks about their Medication it would be recommended to request all MedicationRequest FHIR resource types. Interpret the resources by explaining the data relevant to the user's health. Explain the relevant medical context in a language understandable by a user who is not a medical professional, ideally at a 5th-grade reading level. You should provide factual and precise information in a compact summary in short responses. The patient resource is provided as the initial context. Ensure to leave out any sensitive numbers like SSN, passport number, and telephone number. Do not introduce yourself at the beginning and immediately return a summary of the user based on the FHIR patient resources. No not request any FHIR resources using the "get_resources" function for your first message. The initial summary should be short and simple; stay at a high level. End with a question asking the user if they have any questions. Make sure your response is in the same language the user writes to you in, not the one stated in the patient resource. The tense should be present.
de: Sie sind eine Anwendung, die die Aufgabe hat, FHIR-Ressourcen aus den Krankenakten des Benutzers zu interpretieren. Verwenden Sie während des gesamten Gesprächs mit dem Benutzer die Funktion "get_resources", um die FHIR-Gesundheitsressourcen zu erhalten, die für die ordnungsgemäße Beantwortung der Frage des Benutzers erforderlich sind. Wenn der Benutzer beispielsweise nach seinen Allergien fragt, müssen Sie die Funktion "get_resources" verwenden, um die FHIR-Ressourcentitel für Allergiedatensätze auszugeben, damit Sie diese dann zur Beantwortung der Frage verwenden können. Ziel ist es, die Frage des Benutzers bestmöglich zu beantworten und dabei die mit "get_resources" erhaltenen FHIR-Ressourcen zu berücksichtigen. Lassen Sie alle technischen Details wie JSON, FHIR-Ressourcen und andere Implementierungsdetails der zugrunde liegenden Datenressourcen weg. Fordern Sie nur relevante Ressourcen an und konzentrieren Sie sich auf aktuelle Ressourcen. Versuchen Sie, die Anzahl der angeforderten Ressourcen auf ein vernünftiges Maß zu reduzieren. Wenn der Benutzer z. B. nach seinen Medikamenten fragt, wäre es empfehlenswert, alle FHIR-Ressourcentypen MedicationRequest anzufordern. Interpretieren Sie die Ressourcen, indem Sie die für die Gesundheit des Benutzers relevanten Daten erklären. Erläutern Sie den relevanten medizinischen Kontext in einer Sprache, die für einen Benutzer, der kein Mediziner ist, verständlich ist, idealerweise auf dem Niveau der fünften Klasse. Sie sollten sachliche und präzise Informationen in einer kompakten Zusammenfassung in kurzen Antworten bereitstellen. Die Patientenressource wird als anfänglicher Kontext bereitgestellt. Stellen Sie sicher, dass Sie alle sensiblen Nummern wie SSN, Passnummer und Telefonnummer weglassen. Stellen Sie sich nicht zu Beginn vor und geben Sie sofort eine Zusammenfassung des Benutzers auf der Grundlage der FHIR-Patientenressourcen zurück. Fordern Sie für Ihre erste Nachricht keine FHIR-Ressourcen über die Funktion "get_resources" an. Die erste Zusammenfassung sollte kurz und einfach sein; bleiben Sie auf einem hohen Niveau. Beenden Sie sie mit einer Frage an den Benutzer, ob er noch Fragen hat. Achten Sie darauf, dass Ihre Antwort in derselben Sprache verfasst ist, in der der Benutzer Ihnen schreibt, und nicht in der Sprache, die in der Patientenressource angegeben ist. Die Zeitform sollte das Präsens sein.
es: Usted es una aplicación encargada de interpretar los recursos FHIR de la historia clínica del usuario. A lo largo de la conversación con el usuario, utilice la función "get_resources" para obtener los recursos sanitarios FHIR necesarios para responder correctamente a la pregunta del usuario. Por ejemplo, si el usuario pregunta por sus alergias, debe utilizar la función "get_resources" para obtener los títulos de los recursos FHIR de los registros de alergias, de modo que pueda utilizarlos para responder a la pregunta. El objetivo final es responder a la pregunta del usuario de la mejor manera posible teniendo en cuenta los recursos FHIR obtenidos mediante "get_resources". Omita cualquier detalle técnico como JSON, recursos FHIR y otros detalles de implementación de los recursos de datos subyacentes. Solicite únicamente recursos relevantes y céntrese en los recursos recientes. Intente reducir el número de recursos solicitados a un ámbito razonable. Por ejemplo, si el usuario pregunta por su medicación, se recomienda solicitar todos los tipos de recursos FHIR MedicationRequest. Interpretar los recursos explicando los datos relevantes para la salud del usuario. Explique el contexto médico relevante en un lenguaje comprensible para un usuario que no sea un profesional médico, idealmente a un nivel de lectura de 5º grado. Debe proporcionar información objetiva y precisa en un resumen compacto en respuestas breves. El recurso del paciente se proporciona como contexto inicial. Asegúrese de omitir cualquier número sensible como SSN, número de pasaporte y número de teléfono. No se presente al principio y devuelva inmediatamente un resumen del usuario basado en los recursos de paciente FHIR. No solicite ningún recurso FHIR utilizando la función "get_resources" para su primer mensaje. El resumen inicial debe ser breve y sencillo; manténgase en un nivel alto. Termine con una pregunta al usuario si tiene alguna duda. Asegúrate de que tu respuesta está en el mismo idioma en el que te escribe el usuario, no en el que se indica en el recurso del paciente. El tiempo verbal debe ser presente.
fr: Vous êtes une application chargée d'interpréter les ressources FHIR à partir des dossiers cliniques de l'utilisateur. Tout au long de la conversation avec l'utilisateur, utilisez la fonction "get_resources" pour obtenir les ressources de santé FHIR nécessaires pour répondre correctement à la question de l'utilisateur. Par exemple, si l'utilisateur pose des questions sur ses allergies, vous devez utiliser la fonction "get_resources" pour obtenir les titres des ressources FHIR pour les dossiers d'allergies afin de pouvoir les utiliser pour répondre à la question. L'objectif final est de répondre à la question de l'utilisateur de la meilleure façon possible tout en tenant compte des ressources FHIR obtenues à l'aide de "get_resources". Laissez de côté les détails techniques tels que JSON, les ressources FHIR et les autres détails de mise en œuvre des ressources de données sous-jacentes. Ne demandez que les ressources pertinentes et concentrez-vous sur les ressources récentes. Essayez de réduire le nombre de ressources demandées à un niveau raisonnable. Par exemple, si l'utilisateur demande des informations sur ses médicaments, il est recommandé de demander tous les types de ressources FHIR MedicationRequest. Interpréter les ressources en expliquant les données pertinentes pour la santé de l'utilisateur. Expliquez le contexte médical pertinent dans un langage compréhensible par un utilisateur qui n'est pas un professionnel de la santé, idéalement à un niveau de lecture de 5e année. Vous devez fournir des informations factuelles et précises sous la forme d'un résumé compact dans des réponses courtes. La ressource du patient est fournie comme contexte initial. Veillez à ne pas indiquer les numéros sensibles tels que le SSN, le numéro de passeport et le numéro de téléphone. Ne vous présentez pas au début et ne renvoyez pas immédiatement un résumé de l'utilisateur basé sur les ressources patient FHIR. Ne demandez pas de ressources FHIR à l'aide de la fonction "get_resources" pour votre premier message. Le résumé initial doit être court et simple ; restez à un niveau élevé. Terminez par une question demandant à l'utilisateur s'il a des questions. Veillez à ce que votre réponse soit rédigée dans la même langue que celle dans laquelle l'utilisateur vous écrit, et non dans celle indiquée dans la ressource destinée au patient. Le temps doit être au présent.
zh_hans: 您是一个应用程序，负责解释用户临床记录中的 FHIR 资源。 在与用户的整个对话过程中，使用 "get_resources "函数获取必要的 FHIR 健康资源，以便正确回答用户的问题。例如，如果用户询问他们的过敏情况，就必须使用 "get_resources "函数输出过敏记录的 FHIR 资源标题，这样就可以使用这些资源回答用户的问题。最终目标是在考虑使用 "get_resources "获取的 FHIR 资源的同时，以最佳方式回答用户的问题。请忽略任何技术细节，如 JSON、FHIR 资源和底层数据资源的其他实现细节。 只请求相关资源，并关注最新资源。尽量将请求的资源数量减少到合理范围。 例如，如果用户询问其用药情况，建议请求所有 MedicationRequest FHIR 资源类型。 通过解释与用户健康相关的数据来解释资源。用非专业医疗人员也能理解的语言解释相关医疗背景，最好能达到五年级的阅读水平。您应在简短的回复中以紧凑的摘要提供事实和准确的信息。 患者资源作为初始上下文提供。确保省略任何敏感数字，如 SSN、护照号码和电话号码。 不要在一开始就介绍自己，并立即根据 FHIR 患者资源返回用户摘要。不要在第一条信息中使用 "get_resources "函数请求任何 FHIR 资源。初始摘要应简短；保持在较高水平。最后询问用户是否有任何问题。确保您的回复使用与用户写信给您时相同的语言，而不是患者资源中所述的语言。时态应为现在时。

source: Observations
de: Beobachtungen
es: Observaciones
zh_hans: 意见

# OPEN_AI_KEY_SAVE_ACTION
source: Save API Key
de: API-Schlüssel speichern
es: Guardar Clave de API
fr: Enregistrer la Clé d'API
zh_hans: 保存API密钥

# OPEN_AI_MODEL_SAVE_ACTION
source: Save Model Selection
de: Auswahl des Modells speichern
es: Guardar Selección de Modelo
fr: Enregistrer la Sélection du Modèle
zh_hans: 保存模型选择

source: Other Resources
de: Andere Ressourcen
es: Otros recursos
fr: Autres ressources
zh_hans: 其他资源

# PARAMETER_DESCRIPTION
source: An array of all the FHIR health record titles with the exact same name as given in the list that are applicable to answer the user's questions. It is possible that multiple titles apply to the users's question (e.g for multiple medications). You can also request a larger set of FHIR resources by, e.g., just stating the resource type but this might not include all relevant resources to avoid exceeding the token limit. The FHIR resource identifiers are composed of three elements: 1. The FHIR resource type, e.g., MedicationRequest, Condition, and more. 2. The title of the FHIR resource 3. The date associated with the FHIR resource. Use these informations to determine the best possible FHIR resource for each question. Try to request all the required titles to allow yourself to fully answer the question in a comprehensive manner. For example, if the user asks about their Medication it would be recommended to request all MedicationRequest FHIR resource types as well as other related FHIR resources. A question can build upon a previous question and does not need to be explicit. e.g. if a user says prescribe, this is associated with medication.
de: Ein Array aller FHIR-Gesundheitsdatentitel mit dem exakt gleichen Namen wie in der Liste angegeben, die für die Beantwortung der Fragen des Benutzers in Frage kommen. Es ist möglich, dass mehrere Titel auf die Frage des Benutzers zutreffen (z. B. für mehrere Medikamente). Sie können auch einen größeren Satz von FHIR-Ressourcen anfordern, indem Sie z. B. nur den Ressourcentyp angeben, was jedoch möglicherweise nicht alle relevanten Ressourcen umfasst, um eine Überschreitung des Token-Limits zu vermeiden. Die FHIR-Ressourcenbezeichner setzen sich aus drei Elementen zusammen: 1. Der FHIR-Ressourcentyp, z.B. MedicationRequest, Condition, und weitere. 2. Der Titel der FHIR-Ressource 3. Das mit der FHIR-Ressource verbundene Datum. Verwenden Sie diese Informationen, um die bestmögliche FHIR-Ressource für jede Frage zu bestimmen. Versuchen Sie, alle erforderlichen Titel abzufragen, damit Sie die Frage umfassend beantworten können. Wenn der Benutzer beispielsweise nach seiner Medikation fragt, wäre es empfehlenswert, alle FHIR-Ressourcentypen "MedicationRequest" sowie andere verwandte FHIR-Ressourcen anzufordern. Eine Frage kann auf einer vorherigen Frage aufbauen und muss nicht explizit sein. Wenn ein Benutzer z. B. "prescribe" (verschreiben) sagt, ist dies mit "medication" (Medikamente) verbunden.
es: Una matriz de todos los títulos de historiales médicos FHIR con el mismo nombre exacto que el indicado en la lista que son aplicables para responder a las preguntas del usuario. Es posible que se apliquen varios títulos a la pregunta del usuario (por ejemplo, para varios medicamentos). También puede solicitar un conjunto más amplio de recursos FHIR, por ejemplo, indicando sólo el tipo de recurso, pero es posible que no incluya todos los recursos relevantes para evitar superar el límite de tokens. Los identificadores de recursos FHIR se componen de tres elementos: 1. 1. El tipo de recurso FHIR, por ejemplo, MedicationRequest, Condition, etc. 2. El título del recurso FHIR. 3. La fecha asociada al recurso FHIR. Utilice esta información para determinar el mejor recurso FHIR posible para cada pregunta. Intente solicitar todos los títulos necesarios para poder responder a la pregunta de forma completa. Por ejemplo, si el usuario pregunta sobre su medicación, sería recomendable solicitar todos los tipos de recursos FHIR MedicationRequest, así como otros recursos FHIR relacionados. Una pregunta puede basarse en una pregunta anterior y no necesita ser explícita. Por ejemplo, si un usuario dice prescribir, esto se asocia con la medicación.
fr: Un tableau de tous les titres d'enregistrements de santé FHIR ayant exactement le même nom que celui donné dans la liste et qui sont applicables pour répondre aux questions de l'utilisateur. Il est possible que plusieurs titres s'appliquent à la question de l'utilisateur (par exemple pour plusieurs médicaments). Vous pouvez également demander un ensemble plus large de ressources FHIR, par exemple en indiquant simplement le type de ressource, mais il se peut que cela n'inclue pas toutes les ressources pertinentes pour éviter de dépasser la limite de jetons. Les identifiants de ressources FHIR sont composés de trois éléments : 1. Le type de ressource FHIR, par exemple MedicationRequest, Condition, etc. 2. Le titre de la ressource FHIR 3. La date associée à la ressource FHIR. Utilisez ces informations pour déterminer la meilleure ressource FHIR possible pour chaque question. Essayez de demander tous les titres requis pour vous permettre de répondre à la question de manière complète. Par exemple, si l'utilisateur pose une question sur ses médicaments, il est recommandé de demander tous les types de ressources FHIR MedicationRequest ainsi que d'autres ressources FHIR connexes. Une question peut s'appuyer sur une question précédente et n'a pas besoin d'être explicite. Par exemple, si un utilisateur dit "prescrire", cela est associé aux médicaments.
zh_hans: 一个数组，包含与列表中给出的名称完全相同且适用于回答用户问题的所有 FHIR 健康记录标题。可能有多个标题适用于用户的问题（如多种药物）。您也可以请求更多的 FHIR 资源，例如只说明资源类型，但这可能不包括所有相关资源，以避免超出令牌限制。 FHIR 资源标识符由三个元素组成： 1. FHIR 资源类型，如 MedicationRequest、Condition 等。 2. FHIR 资源的标题 3. 与 FHIR 资源相关的日期。 使用这些信息为每个问题确定最佳的 FHIR 资源。尽量要求提供所有必要的标题，以便全面回答问题。 例如，如果用户询问他们的用药情况，建议请求所有 MedicationRequest FHIR 资源类型以及其他相关的 FHIR 资源。 例如，如果用户说 "处方"，这就与用药相关联。

source: Procedures
de: Verfahren
es: Procedimientos
fr: Procédures
zh_hans: 程序

source: Reset Chat
de: Chat zurücksetzen
es: Reiniciar chat
fr: Réinitialiser le chat
zh_hans: 重置聊天

# Resource Selection
source: Resources Selection
de: Resourcen Auswahl
es: Selección de recursos
fr: Sélection des ressources
zh_hans: 资源选择

# Resource Settings
source: Resources Settings
de: Resourcen Einstellungen
es: Configuración de recursos
fr: Paramètres des ressources
zh_hans: 资源设置

source: Save Prompt
de: Prompt speichern
es: Guardar aviso
fr: Sauvegarder l'invite
zh_hans: 保存提示

source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres
zh_hans: 设置

# SETTINGS_DONE
source: Done
de: Fertig

# SETTINGS_OPENAI
source: Open AI Settings
de: Open AI-Einstellungen
es: Configuración de Open AI
fr: Paramètres d'Open AI
zh_hans: Open AI设置

# SETTINGS_OPENAI_KEY
source: Open AI API Key
de: Open AI API-Schlüssel
es: Clave de API de Open AI
fr: Clé d'API d'Open AI
zh_hans: Open AI API密钥

# SETTINGS_OPENAI_MODEL_INTERPRETATION
source: Open AI Interpretation Model
de: OpenAI Interpretationsmodell
es: Modelo abierto de interpretación de la IA
fr: Modèle ouvert d'interprétation de l'IA
zh_hans: 开放式人工智能解释模型

# SETTINGS_OPENAI_MODEL_MULTIPLE_RESOURCE_INTERPRETATION
source: Open AI Multiple Resource Interpretation Model
de: OpenAI Mehrere Resourcen Interpretationsmodell
es: Modelo de interpretación de recursos múltiples de IA abierta
fr: Modèle ouvert d'interprétation des ressources multiples de l'IA
zh_hans: 开放式人工智能多种资源解释模型

# SETTINGS_OPENAI_MODEL_SUMMARY
source: Open AI Summarization Model
de: OpenAI Zusammenfassungsmodell
es: Modelo abierto de síntesis de IA
fr: Modèle ouvert de résumé de l'IA
zh_hans: 开放式人工智能总结模型

# SETTINGS_PROMPT_CAPTION %@
source: SPlace %@ at the position in the prompt where the FHIR resource should be inserted.
de: Platzieren Sie %@ an der Stelle im Prompt, an der die FHIR-Ressource eingefügt werden soll.
es: Coloque %@ en la posición de la pregunta donde debe insertarse el recurso FHIR.
fr: Placez %@ à l'emplacement de l'invite où la ressource FHIR doit être insérée.
zh_hans: 在提示中的位置插入%@的位置。

# SETTINGS_PROMPT_DESCRITPTION %@
source: Customize the %@ prompt.
de: Passen Sie den %@-Prompt an.
es: Personalice la pregunta para %@.
fr: Personnalisez l'invite pour %@.
zh_hans: 自定义%@提示。

# SETTINGS_PROMPTS
source: Prompt Settings
de: Prompt-Einstellungen
es: Configuración de Preguntas
fr: Paramètres des Invites
zh_hans: 提示设置

# SETTINGS_PROMPTS_INTERPRETATION
source: Interpretation Prompt
de: Interpretations-Prompt
es: Pregunta para Interpretación
fr: Invite pour Interprétation
zh_hans: 解释提示

# SETTINGS_PROMPTS_INTERPRETATION_MULTIPLE_RESOURCES
source: Interpretation Prompt for Multiple Resources
de: Interpretations-Prompt für mehrere Ressourcen
es: Pregunta para Interpretación de Múltiples Recursos
fr: Invite pour Interprétation de Multiples Ressources
zh_hans: 多资源解释提示

# SETTINGS_PROMPTS_SUMMARY
source: Summary Prompt
de: Zusammenfassungs-Prompt
es: Pregunta para Resumen
fr: Invite pour Résumé
zh_hans: 摘要提示

# SETTINGS_SPEECH
source: Speech Settings
de: Spracheinstellungen
es: Ajustes de voz
fr: Paramètres de la parole
zh_hans: 语音设置

# SETTINGS_SPEECH_TEXT_TO_SPEECH
source: Enable Text to Speech
de: Text-zu-Sprache
es: Activar la conversión de texto a voz
fr: Activer la synthèse vocale
zh_hans: 启用文本到语音

# SETTINGS_TITLE
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
zh_hans: 设置

source: Summary Prompt
de: Zusammenfassungs Prompt
es: Resumen
fr: Résumé de l'énoncé
zh_hans: 摘要提示
